[Survived] StringLiteral
src/App.js:6:44
 import {Button, Grid} from "@mui/material";
 
 function App() {
-    const mainContainerStyles = {minWidth: '100vw', minHeight: '100vh' };
+    const mainContainerStyles = {minWidth: "", minHeight: '100vh' };
     const numberStyles = {margin: 'auto', textAlign: 'center', verticalAlign: 'middle', fontSize: '16em', minHeight: '90vh' };
     const buttonStyles = {textAlign: 'center'};

[Survived] ObjectLiteral
src/App.js:7:26
 
 function App() {
     const mainContainerStyles = {minWidth: '100vw', minHeight: '100vh' };
-    const numberStyles = {margin: 'auto', textAlign: 'center', verticalAlign: 'middle', fontSize: '16em', minHeight: '90vh' };
+    const numberStyles = {};
     const buttonStyles = {textAlign: 'center'};
     const [time, setTime] = useState(0);

[Survived] StringLiteral
src/App.js:7:118
 
 function App() {
     const mainContainerStyles = {minWidth: '100vw', minHeight: '100vh' };
-    const numberStyles = {margin: 'auto', textAlign: 'center', verticalAlign: 'middle', fontSize: '16em', minHeight: '90vh' };
+    const numberStyles = {margin: 'auto', textAlign: 'center', verticalAlign: 'middle', fontSize: '16em', minHeight: "" };
     const buttonStyles = {textAlign: 'center'};
     const [time, setTime] = useState(0);

[Survived] ObjectLiteral
src/App.js:8:26
 function App() {
     const mainContainerStyles = {minWidth: '100vw', minHeight: '100vh' };
     const numberStyles = {margin: 'auto', textAlign: 'center', verticalAlign: 'middle', fontSize: '16em', minHeight: '90vh' };
-    const buttonStyles = {textAlign: 'center'};
+    const buttonStyles = {};
     const [time, setTime] = useState(0);
     const [startEnabled, setStartEnabled] = useState(true);

[Killed] BooleanLiteral
src/App.js:10:54
     const numberStyles = {margin: 'auto', textAlign: 'center', verticalAlign: 'middle', fontSize: '16em', minHeight: '90vh' };
     const buttonStyles = {textAlign: 'center'};
     const [time, setTime] = useState(0);
-    const [startEnabled, setStartEnabled] = useState(true);
+    const [startEnabled, setStartEnabled] = useState(false);
 
     const addTime = () => setTime(time+1)
killedBy: a stopwatch it does substract a unit each second when pressing start
statusReason: Error: Unable to perform pointer interaction as the element has `pointer-events: none`:

BUTTON(label=start)

[Killed] ArrowFunction
src/App.js:12:21
     const [time, setTime] = useState(0);
     const [startEnabled, setStartEnabled] = useState(true);
 
-    const addTime = () => setTime(time+1)
+    const addTime = () => undefined
     const substractTime = () => {
         if (time > 0) setTime(time-1);
killedBy: a stopwatch it adds a unit to the counter when + is clicked
statusReason: TestingLibraryElementError: Unable to find an element with the text: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiGrid-root MuiGrid-container css-11lq3yg-MuiGrid-root"
      style="min-width: 100vw

[Killed] ArithmeticOperator
src/App.js:12:35
     const [time, setTime] = useState(0);
     const [startEnabled, setStartEnabled] = useState(true);
 
-    const addTime = () => setTime(time+1)
+    const addTime = () => setTime(time - 1)
     const substractTime = () => {
         if (time > 0) setTime(time-1);
killedBy: a stopwatch it adds a unit to the counter when + is clicked
statusReason: TestingLibraryElementError: Unable to find an element with the text: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiGrid-root MuiGrid-container css-11lq3yg-MuiGrid-root"
      style="min-width: 100vw

[Killed] BlockStatement
src/App.js:13:33
     const [startEnabled, setStartEnabled] = useState(true);
 
     const addTime = () => setTime(time+1)
-    const substractTime = () => {
-        if (time > 0) setTime(time-1);
-    }
+    const substractTime = () => {}
 
     const start = () => {
killedBy: a stopwatch it substracts a unit to the counter when - is clicked
statusReason: TestingLibraryElementError: Unable to find an element with the text: 0. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiGrid-root MuiGrid-container css-11lq3yg-MuiGrid-root"
      style="min-width: 100vw

[Killed] ArithmeticOperator
src/App.js:14:31
 
     const addTime = () => setTime(time+1)
     const substractTime = () => {
-        if (time > 0) setTime(time-1);
+        if (time > 0) setTime(time + 1);
     }
 
killedBy: a stopwatch it substracts a unit to the counter when - is clicked
statusReason: TestingLibraryElementError: Unable to find an element with the text: 0. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiGrid-root MuiGrid-container css-11lq3yg-MuiGrid-root"
      style="min-width: 100vw

[Killed] EqualityOperator
src/App.js:14:13
 
     const addTime = () => setTime(time+1)
     const substractTime = () => {
-        if (time > 0) setTime(time-1);
+        if (time <= 0) setTime(time-1);
     }
 
killedBy: a stopwatch it substracts a unit to the counter when - is clicked
statusReason: TestingLibraryElementError: Unable to find an element with the text: 0. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiGrid-root MuiGrid-container css-11lq3yg-MuiGrid-root"
      style="min-width: 100vw

[Killed] BlockStatement
src/App.js:17:25
         if (time > 0) setTime(time-1);
     }
 
-    const start = () => {
-        setStartEnabled(false);
-        const intervalId = setInterval(() => {
-            setTime((time) => {
-                if (time > 0) return time - 1;
-                clearInterval(intervalId);
-                setStartEnabled(true);
-                return time;
-            });
-        }, 1000);
-    }
+    const start = () => {}
 
   return (
killedBy: a stopwatch it does substract a unit each second when pressing start
statusReason: Error: Unable to find an element with the text: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiGrid-root MuiGrid-container css-11lq3yg-MuiGrid-root"
      style="min-width: 100vw; min-height: 100vh;"

[Killed] BooleanLiteral
src/App.js:18:25
     }
 
     const start = () => {
-        setStartEnabled(false);
+        setStartEnabled(true);
         const intervalId = setInterval(() => {
             setTime((time) => {
killedBy: a stopwatch it disables start button when the countdown starts
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:

[Killed] BlockStatement
src/App.js:19:46
 
     const start = () => {
         setStartEnabled(false);
-        const intervalId = setInterval(() => {
-            setTime((time) => {
-                if (time > 0) return time - 1;
-                clearInterval(intervalId);
-                setStartEnabled(true);
-                return time;
-            });
-        }, 1000);
+        const intervalId = setInterval(() => {}, 1000);
     }
 
killedBy: a stopwatch it does substract a unit each second when pressing start
statusReason: Error: Unable to find an element with the text: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiGrid-root MuiGrid-container css-11lq3yg-MuiGrid-root"
      style="min-width: 100vw; min-height: 100vh;"

[Killed] BlockStatement
src/App.js:20:31
     const start = () => {
         setStartEnabled(false);
         const intervalId = setInterval(() => {
-            setTime((time) => {
-                if (time > 0) return time - 1;
-                clearInterval(intervalId);
-                setStartEnabled(true);
-                return time;
-            });
+            setTime((time) => {});
         }, 1000);
     }
killedBy: a stopwatch it does substract a unit each second when pressing start
statusReason: Error: Unable to find an element with the text: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiGrid-root MuiGrid-container css-11lq3yg-MuiGrid-root"
      style="min-width: 100vw; min-height: 100vh;"

[Killed] ArithmeticOperator
src/App.js:21:38
         setStartEnabled(false);
         const intervalId = setInterval(() => {
             setTime((time) => {
-                if (time > 0) return time - 1;
+                if (time > 0) return time + 1;
                 clearInterval(intervalId);
                 setStartEnabled(true);
killedBy: a stopwatch it does substract a unit each second when pressing start
statusReason: Error: Unable to find an element with the text: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiGrid-root MuiGrid-container css-11lq3yg-MuiGrid-root"
      style="min-width: 100vw; min-height: 100vh;"

[Killed] EqualityOperator
src/App.js:21:21
         setStartEnabled(false);
         const intervalId = setInterval(() => {
             setTime((time) => {
-                if (time > 0) return time - 1;
+                if (time >= 0) return time - 1;
                 clearInterval(intervalId);
                 setStartEnabled(true);
killedBy: a stopwatch it enables start button when the countdown finishes
statusReason: Error: expect(element).toBeEnabled()

Received element is not enabled:

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BooleanLiteral
src/App.js:23:33
             setTime((time) => {
                 if (time > 0) return time - 1;
                 clearInterval(intervalId);
-                setStartEnabled(true);
+                setStartEnabled(false);
                 return time;
             });
killedBy: a stopwatch it enables start button when the countdown finishes
statusReason: Error: expect(element).toBeEnabled()

Received element is not enabled:

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BooleanLiteral
src/App.js:39:35
                 <Button onClick={substractTime}>-</Button>
             </Grid>
             <Grid xs={4} style={buttonStyles}>
-                <Button disabled={!startEnabled} onClick={start}>start</Button>
+                <Button disabled={startEnabled} onClick={start}>start</Button>
             </Grid>
             <Grid xs={4} style={buttonStyles}>
killedBy: a stopwatch it does substract a unit each second when pressing start
statusReason: Error: Unable to perform pointer interaction as the element has `pointer-events: none`:

BUTTON(label=start)
